twitterx/app/controllers/api_controller.rb

  def news
      tweets = []
      @tweets = Tweet.last(50)
        @tweets.each do |tweet|
        tweets <<  { id: tweet.id, content: tweet.content, user_id: tweet.user_id, likes_count: tweet.likes_count, retweets_count: tweet.retweets_count, rewtitted_from: tweet.retweets.ids.last }
---
SELECT "tweets".* FROM "tweets" ORDER BY "tweets"."id" DESC LIMIT ?  [["LIMIT", 50]]
SELECT "tweets".* FROM "tweets" LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "retweets" WHERE "retweets"."tweet_id" = ?  [["tweet_id", 1]]

  def date
      @tweets_date = Tweet.where(created_at: [params[:start_date]..params[:end_date]])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."created_at" BETWEEN ? AND ?  [["created_at", "2020-09-06 00:00:00"], ["created_at", "2020-09-07 00:00:00"]]