twitterx/app/controllers/follows_controller.rb

  def create
    @user_tweet = Tweet.find_by(params[:id])
    @user = @user_tweet.user_id
    @follow = Follow.create(follower_id:current_user.id, following_id:@user)
---
INSERT INTO "follows" ("follower_id", "following_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 6], ["following_id", 6], ["created_at", "2020-09-12 21:40:14.446303"], ["updated_at", "2020-09-12 21:40:14.446303"]]