twitterx/app/controllers/likes_controller.rb

  def create
    if already_liked?
      flash[:notice] = "You can't like more than once"
    else
    @tweet.likes.create(user_id: current_user.id)
    @tweet.likes_count += 1
    end
    @tweet.save
---
INSERT INTO "likes" ("tweet_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tweet_id", 3], ["user_id", 1], ["created_at", "2020-09-06 02:58:53.836077"], ["updated_at", "2020-09-06 02:58:53.836077"]]
UPDATE "tweets" SET "likes_count" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["likes_count", 1], ["updated_at", "2020-09-09 22:17:02.748830"], ["id", 10]]

  def destroy
    if !(already_liked?)
      flash[:notice] = "Cannot unlike"
    else
      @like.destroy
      @tweet.likes_count -= 1
    end
    @tweet.save
---
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 14]]
UPDATE "tweets" SET "likes_count" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["likes_count", 0], ["updated_at", "2020-09-10 22:37:59.007724"], ["id", 2]]

  def find_tweet
    @tweet = Tweet.find(params[:tweet_id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def already_liked?
    Like.where(user_id: current_user.id, tweet_id:
    params[:tweet_id]).exists?
---
SELECT "likes".* FROM "likes" WHERE "likes"."tweet_id" = ? AND "likes"."id" = ? LIMIT ?  [["tweet_id", 6], ["id", 5], ["LIMIT", 1]]
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."tweet_id" = ? LIMIT ?  [["user_id", 1], ["tweet_id", 10], ["LIMIT", 1]]

  def find_like
    @like = @tweet.likes.find(params[:id])
---
SELECT "likes".* FROM "likes" WHERE "likes"."tweet_id" = ? AND "likes"."id" = ? LIMIT ?  [["tweet_id", 2], ["id", 23], ["LIMIT", 1]]