twitterx/app/controllers/retweets_controller.rb

INSERT INTO "tweets" ("content", "retweets_count", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "retweets" ("tweet_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tweet_id", 3], ["user_id", 1], ["created_at", "2020-09-06 02:59:06.027755"], ["updated_at", "2020-09-06 02:59:06.027755"]]
---
  def create
    if already_retweeted?
      flash[:notice] = "You can't retweet more than once"
    else
      @tweet.retweets.create(user_id: current_user.id)
      @tweet = Tweet.new(user_id: current_user.id, content: "Retweet from ↪ : #{@tweet.user.name} --#{@tweet.content}--")
      @tweet.retweets_count += 1
    end
      @tweet.save

DELETE FROM "retweets" WHERE "retweets"."id" = ?  [["id", 8]]
UPDATE "tweets" SET "retweets_count" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["retweets_count", -1], ["updated_at", "2020-09-10 22:38:46.332105"], ["id", 1]]
---
  def destroy
    if !(already_retweeted?)
      flash[:notice] = "Cannot unretweet"
    else
      @retweet.destroy
      @tweet.retweets_count -= 1
    end
    @tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_tweet
    @tweet = Tweet.find(params[:tweet_id])

SELECT 1 AS one FROM "retweets" WHERE "retweets"."user_id" = ? AND "retweets"."tweet_id" = ? LIMIT ?  [["user_id", 5], ["tweet_id", 1], ["LIMIT", 1]]
---
  def already_retweeted?
    Retweet.where(user_id: current_user.id, tweet_id:
    params[:tweet_id]).exists?

SELECT "retweets".* FROM "retweets" WHERE "retweets"."tweet_id" = ? AND "retweets"."id" = ? LIMIT ?  [["tweet_id", 2], ["id", 8], ["LIMIT", 1]]
---
  def find_retweet
    @retweet = @tweet.retweets.find(params[:id])