twitterx/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" WHERE (content LIKE '%dosdos%')
SELECT COUNT(*) FROM "tweets"
---
  def index
    @tweet = Tweet.new
    if params[:search]
      @search = params[:search]
      @tweets = Tweet.where("content LIKE ?", "%#{@search}%")
      @tweets.class == Array
      @tweets = Kaminari.paginate_array(@tweets).page params[:page]

SELECT "likes".* FROM "likes" WHERE "likes"."tweet_id" = ?  [["tweet_id", 2]]
---
  def show
    @likes = @tweet.likes.all

INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "#uno lorem ipsum"], ["user_id", 1], ["created_at", "2020-09-06 03:44:36.751134"], ["updated_at", "2020-09-06 03:44:36.751134"]]
---
  def create
    @tweet = Tweet.new(tweet_params.permit(:content, :user_id))
    @tweet.user = current_user

    respond_to do |format|
      if @tweet.save