twitterx/app/models/tweet.rb

INSERT INTO "tweet_hash_tags" ("tweet_id", "hash_tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tweet_id", 11], ["hash_tag_id", 7], ["created_at", "2020-09-12 21:11:52.779052"], ["updated_at", "2020-09-12 21:11:52.779052"]]
---
  def create_hash_tags
    extract_tag_hash_tags.each do |tag|
      hash_tags.create(tag: tag)