twitterx/app/admin/users.rb

      t.column("email"){ |user| user.email}
      t.column("image_url"){ |user| user.image_url}
      t.column("created_at"){ |user| user.created_at}
      t.column("tweets"){ |user| user.tweets.count}
      t.column("likes"){ |user| user.likes.count}
      t.column("retweets"){ |user| user.retweets.count}
---
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "retweets" WHERE "retweets"."user_id" = ?  [["user_id", 1]]