twitterx/app/views/tweets/show.html.erb

      <br>
      <%= image_tag (@tweet.user.image_url), size: '100', class:"rounded-circle" if @tweet.user.image_url.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

      <br>likes
      <%= button_tag (@tweet.likes.count), class:"btn btn-outline-primary rounded-circle" %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."tweet_id" = ?  [["tweet_id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."tweet_id" = ?  [["tweet_id", 2]]

      <% if current_user.present? %>
      <% pre_like = @tweet.likes.find { |like| like.user_id == current_user.id} %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."tweet_id" = ?  [["tweet_id", 2]]

      <br>retweets
      <%= button_tag (@tweet.retweets.count), class:"btn btn-outline-primary rounded-circle" %>
---
SELECT "retweets".* FROM "retweets" WHERE "retweets"."tweet_id" = ?  [["tweet_id", 2]]
SELECT COUNT(*) FROM "retweets" WHERE "retweets"."tweet_id" = ?  [["tweet_id", 2]]

         <% if current_user.present? %>
      <% pre_retweet = @tweet.retweets.find { |retweet| retweet.user_id == current_user.id} %>
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "retweets".* FROM "retweets" WHERE "retweets"."tweet_id" = ?  [["tweet_id", 2]]